/*********************************************************************
C语言实现面向对象（转）
参考：  https://www.cnblogs.com/zzdbullet/p/10563075.html

1、引言
面向对象编程（OOP）并不是一种特定的语言或者工具，它只是一种设计方法、设计思想。

它表现出来的三个最基本的特性就是封装、继承与多态。

很多面向对象的编程语言已经包含这三个特性了，例如 Smalltalk、C++、Java。

但是你也可以用几乎所有的编程语言来实现面向对象编程，例如 ANSI-C。要记住，面向对象是一种思想，一种方法，不要太拘泥于编程语言。

2、封装
封装就是把数据和方法打包到一个类里面。其实C语言编程者应该都已经接触过了，C 标准库 中的 fopen(), fclose(), fread(), fwrite()等函数的操作对象就是 FILE。

数据内容就是 FILE，数据的读写操作就是 fread()、fwrite()，fopen() 类比于构造函数，fclose() 就是析构函数。

这个看起来似乎很好理解，那下面我们实现一下基本的封装特性。
***************************************************************************/
































