/**********************************************************************************************************************
  COPYRIGHT
-----------------------------------------------------------------------------------------------------------------------
  Copyright (c) 2014 by Vector Informatik GmbH.                                                    All rights reserved.

                This software is copyright protected and proprietary to Vector Informatik GmbH.
                Vector Informatik GmbH grants to you only those rights as set out in the license conditions.
                All other rights remain with Vector Informatik GmbH.
-----------------------------------------------------------------------------------------------------------------------
  FILE DESCRIPTION
-----------------------------------------------------------------------------------------------------------------------
         File:  sio_drv.c
    Component:  SIO Driver
       Module:  DrvLin_78k0rSci
    Generator:  DrvLin_78k0rSci

  Description:  Implementation of SIO Driver for 78K0R Fx3 using UARTF.
**********************************************************************************************************************/

/**********************************************************************************************************************
  INCLUDES
**********************************************************************************************************************/
#include "v_cfg.h"
#include "v_def.h"
#include "Sio_drv.h"
/* define const */

/************************************************************************************************/
/* Register defines                                                                             */
/************************************************************************************************/
/*==================================================================================*/
/* Bitmasks for LIN_LCUC (LIN control register)                                     */
/*==================================================================================*/
#define LIN_LCUC_REQUEST_RESET            ((vuint8)0x00u)              /* 0 = request reset, 1 = reset request inactive */
#define LIN_LCUC_MODE_WAKEUP              ((vuint8)0x01u)              /* Wakeup mode */
#define LIN_LCUC_MODE_NORMAL              ((vuint8)0x03u)              /* Normal communication mode */

/*==================================================================================*/
/* Bitmasks for LIN_LMST (LIN mode status register)                                 */
/*==================================================================================*/
#define LIN_LMST_RESET_STATE_MASK         ((vuint8)0x01u)              /* Reset status bit: 0 = reset state, 1 = not in reset state */
#define LIN_LMST_WAKEUP_MODE_MASK         ((vuint8)0x02u)              /* Mode bit: 0 = wakeup mode, 1 = normal mode */
#define LIN_LMST_OPERATION_MODE_MASK      ((vuint8)0x03u)              /* Mode bit: 0 = wakeup mode, 1 = normal mode */

#define LIN_LMST_RESET_STATE              ((vuint8)0x00u)              /* Reset status bit: 0 = reset state, 1 = not in reset state */
#define LIN_LMST_WAKEUP_MODE              ((vuint8)0x01u)              /* Mode bit: 0 = wakeup mode, 1 = normal mode */
#define LIN_LMST_OPERATION_MODE           ((vuint8)0x03u)              /* Mode bit: 0 = wakeup mode, 1 = normal mode */

/*==================================================================================*/
/* Bitmasks for LIN_ICR  (Interrupt Control Register)                               */
/*==================================================================================*/
#define LIN_ICR_MK_SET_MASK               ((vuint8)0x80u)              /* Mask to set the MK bit of the ICR */
#define LIN_ICR_MK_CLR_MASK               ((vuint8)0x7Fu)              /* Mask to clear the MK bit of the ICR */
#define LIN_ICR_TB_SET_MASK               ((vuint8)0x40u)              /* Mask to set the TB bit of the ICR */
#define LIN_ICR_TB_CLR_MASK               ((vuint8)0xBFu)              /* Mask to clear the TB bit of the ICR */
#define LIN_ICR_RF_CLR_MASK		      ((vuint8)0xEFu)		/* Mask to clear the RF bit of ICR */

/* Data struct for RLIN Controller  */
typedef volatile struct tLinModule
{
  vuint8         	LIN_Reserved1;          /* 0x0000: Reserved */
  vuint8         	LIN_LWBR;               /* 0x0001: LIN Wake-up baud rate selector register - set only in LIN reset mode */
  vuint16		LIN_LBRP01;		/* 0x0002 - 0x0003: LIN Baud Rate Prescaler 01 Register */
  vuint8         	LIN_LSTC;               /* 0x0004: LIN self test control register - set only in LIN reset mode */
  vuint8         	LIN_Reserved2;          /* 0x0005: Reserved */
  vuint8         	LIN_Reserved3;          /* 0x0006: Reserved */
  vuint8         	LIN_Reserved4;          /* 0x0007: Reserved */
  vuint8         	LIN_LMD;                /* 0x0008: LIN / UART mode register - set only in LIN reset mode */
  vuint8         	LIN_LBFC;               /* 0x0009: LIN break field configuration register - set only in LIN reset mode */
  vuint8         	LIN_LSC;                /* 0x000A: LIN / UART space configuration register - set only in LIN reset mode */
  vuint8         	LIN_LWUP;               /* 0x000B: LIN Wake-up configuration register - set only in LIN reset mode */
  vuint8         	LIN_LIE;                /* 0x000C: LIN interrupt enable register - set only in LIN reset mode */
  vuint8         	LIN_LEDE;               /* 0x000D: LIN / UART error detection enable register */
  vuint8         	LIN_LCUC;               /* 0x000E: LIN / UART control register */
  vuint8         	LIN_Reserved5;          /* 0x000F: Reserved */
  vuint8         	LIN_LTRC;               /* 0x0010: LIN / UART transmission control register */
  vuint8         	LIN_LMST;               /* 0x0011: LIN / UART mode status register */
  vuint8         	LIN_LST;                /* 0x0012: LIN / UART Status register */
  vuint8          	LIN_LEST;               /* 0x0013: LIN / UART error status register */
  vuint8          	LIN_LDFC;               /* 0x0014: LIN / UART data field configuration register */
  vuint8          	LIN_LIDB;               /* 0x0015: LIN / UART identifier buffer register */
  vuint8          	LIN_LCBR;               /* 0x0016: LIN checksum buffer register */
  vuint8          	LIN_LUDB0;              /* 0x0017: UART data buffer 0 register */
  vuint8         	LIN_LDBR1;               /* 0x0018: LIN / UART data buffer 1 register */
  vuint8         	LIN_LDBR2;               /* 0x0019: LIN / UART data buffer 2 register */
  vuint8         	LIN_LDBR3;               /* 0x001A: LIN / UART data buffer 3 register */
  vuint8         	LIN_LDBR4;               /* 0x001B: LIN / UART data buffer 4 register */
  vuint8         	LIN_LDBR5;               /* 0x001C: LIN / UART data buffer 5 register */
  vuint8         	LIN_LDBR6;               /* 0x001D: LIN / UART data buffer 6 register */
  vuint8         	LIN_LDBR7;               /* 0x001E: LIN / UART data buffer 7 register */
  vuint8         	LIN_LDBR8;               /* 0x001F: LIN / UART data buffer 8 register */
} tsLinModule;

/* Defines for internal states */
/*      Lin_OnUninit                          ((Lin_StateType)0x00u) */
#define Lin_OnWake                            ((Lin_StateType)0x01u)
#define Lin_OnSleep                           ((Lin_StateType)0x02u)
#define Lin_OnRx                              ((Lin_StateType)0x03u)
#define Lin_OnS2S                             ((Lin_StateType)0x04u)
#define Lin_OnTx                              ((Lin_StateType)0x06u)
#define Lin_OnTxWakeup                        ((Lin_StateType)0x08u)
/**********************************************************************************************************************
  LOCAL DATA TYPES AND STRUCTURES
**********************************************************************************************************************/
typedef V_MEMRAM0 V_MEMRAM1 vuint8 V_MEMRAM2  Lin_StateType;
